[{"_id":"576bd9e083766a39161cc048","title":"Work Begins on HTML5.1","author":"Simeon Sheytanov","content":"The World Wide Web Consortium (W3C) has begun work on HTML5.1, and this time it is handling the creation of the standard a little differently. The specification has its own GitHub project where anyone can see what is happening and propose changes. The organization says the goal for the new specification is \"to match reality better, to make the specification as clear as possible to readers, and of course to make it possible for all stakeholders to propose improvements, and understand what makes changes to HTML successful.\" Creating HTML5 took years, but W3C hopes using GitHub will speed up the process this time around. It plans to release a candidate recommendation for HTML5.1 by June and a full recommendation in September. ","date":"June 23rd 2016","_acl":{"creator":"576bd9277d51be2b3c25b9dd"},"_kmd":{"lmt":"2016-06-23T12:45:20.680Z","ect":"2016-06-23T12:45:20.680Z"}},{"_id":"576bd9ecbccfb3cc2e008e65","title":"Windows 10 Preview with Bash Support Now Available","author":"Simeon Sheytanov","content":"Microsoft has released a new Windows 10 Insider Preview that includes native support for Bash running on Ubuntu Linux. The company first announced the new feature at last week's Build development conference, and it was one of the biggest stories of the event. The current process for installing Bash is a little complication, but Microsoft has aР’ blog postР’ that explains how the process works. The preview build also includes Cortana upgrades, extensions support, the new Skype Universal Windows Platform app and some interface improvements.","date":"June 23rd 2016","_acl":{"creator":"576bd9277d51be2b3c25b9dd"},"_kmd":{"lmt":"2016-06-23T12:45:32.742Z","ect":"2016-06-23T12:45:32.742Z"}},{"_id":"576bda7215210cb92b711f32","title":"ASP.NET MVC 6 - GruntJS, NPM, and Bower Support","author":"Svetlin Nakov","content":"Front-end development gets a lot of love in ASP.NET 5 through its support for GruntJS (and eventually Gulp).\n\nGruntJS is a task runner that enables you to build front-end resources such as JavaScript and CSS files. For example, you can use GruntJS to concatenate and minify your JavaScript files whenever you perform a build in Visual Studio.\n\nThere are thousands of GruntJS plugins that enable you to do an amazing variety of different tasks (there are currently 4,334 plugins listed in the GruntJS plugin repository):\n\nhttp://gruntjs.com/plugins\n\nFor example, there are plugins for running JavaScript unit tests, for validating the code quality of your JavaScript (jshint), compiling LESS and Sass files into CSS, compiling TypeScript into JavaScript, and minifying images.\n\nIn order to support GruntJS, Microsoft needed to support two new package managers (beyond NuGet). First, because GruntJS plugins are distributed as NPM packages, Microsoft added support for NPM packages.\n\nSecond, because many client-side resources – such as Twitter Bootstrap, jQuery, Polymer, and AngularJS – are distributed through Bower, Microsoft added support for Bower.\n\nThis means that you can run GruntJS using plugins from NPM and client resources from Bower.","date":"June 23rd 2016","_acl":{"creator":"576bda1081d714b142f84ff2"},"_kmd":{"lmt":"2016-06-23T12:47:46.310Z","ect":"2016-06-23T12:47:46.310Z"}},{"_id":"576bdbca15210cb92b71218b","title":"Java Web applications: A brief history","author":"Simeon Sheytanov","content":"This brief history begins with Java's entry into Web application development: the Servlet API, introduced in 1997. Before then, developing dynamic Web applications with disparate APIs and programming models proved to be challenging. (I'll resist the urge to recap the old days of CGI, the futile battle between Netscape Server plug-ins and ISAPI plug-ins, and all the homegrown APIs.) The Servlet API provided a standard on which vendors could build Web containers and developers could implement a simple programming model for constructing Web pages.\n\nWith servlets, dynamically constructing HTML documents became easy. But because the documents were constructed inside Java source code, maintenance was challenging. For example, changing a font or moving a piece of content within a page required you to update the HTML inside the servlet code and then recompile and redeploy it to the container.","date":"June 23rd 2016","_acl":{"creator":"576bd9277d51be2b3c25b9dd"},"_kmd":{"lmt":"2016-06-23T12:53:30.815Z","ect":"2016-06-23T12:53:30.815Z"}},{"_id":"576bdbebc81fef39273f3ffb","title":"Spring: An overview","author":"Simeon Sheytanov","content":"During the early days of Enterprise JavaBeans (EJB), developers led by Rod Johnson created the Spring Framework as a lightweight alternative to Java EE's complexity. Spring is many things -- entire books have been written about it -- but one of the key benefits that it pioneered is dependency injection (DI). DI is a design pattern, coined by Martin Fowler, that separates an application's dependencies (and dependency configuration) from the code that uses those dependencies. Spring implements DI by allowing you to \"wire\" together an application from beans, using either an XML configuration file or annotations. For example, if your application needs to access a database, you can configure your database connection pool in a Spring configuration file and tell Spring to \"inject\" a DataSource from that pool into your data-access object (DAO) bean; then you can inject that DAO into a service bean. The point is that your application should focus on solving its business problems rather than on the overhead required to construct resources and objects. Spring creates your objects for you and makes them available at runtime.","date":"June 23rd 2016","_acl":{"creator":"576bd9277d51be2b3c25b9dd"},"_kmd":{"lmt":"2016-06-23T12:54:03.828Z","ect":"2016-06-23T12:54:03.828Z"}},{"_id":"576bdc9c83766a39161cc60b","title":"Личностните умения на един добър системен администратор","author":"Ivaylo Jelev","content":"За разлика от това, което сте виждали в десетки филми, чували във вицове и виждали в забавни постове из интернет, днешните системни администратори не съскат срещу слънчевата светлина от най-тъмния ъгъл на офиса, който обитават. Нуждите на модерния бизнес влияят на всяко едно звено в една компания, което означава, че техническите умения и сертификацията вече не са всичко, нужно за успеха на един администриращ екип.\n\nТова, което днешната работна среда изисква от един системен администратор не се изчерпва с многозначното взиране в низ от интересно изглеждащи знаци на екрана, както би предположил средностатистическия човек. Изискват се и добре оформени личностни умения, най-ценните от които искаме да ви представим тук.","date":"June 23rd 2016","_acl":{"creator":"576bdc68ca3fcbca73bd43bb"},"_kmd":{"lmt":"2016-06-23T12:57:00.270Z","ect":"2016-06-23T12:57:00.270Z"}}]